In [150]:
import pandas as pd

In [151]:
loan=pd.read_csv("loans.csv")

In [152]:
loan.describe()

          client_id   loan_amount      repaid       loan_id        rate
count    443.000000    443.000000  443.000000    443.000000  443.000000
mean   38911.060948   7982.311512    0.534989  11017.101580    3.217156
std     7768.681063   4172.891992    0.499338    581.826222    2.397168
min    25707.000000    559.000000    0.000000  10009.000000    0.010000
25%    32885.000000   4232.500000    0.000000  10507.500000    1.220000
50%    39505.000000   8320.000000    1.000000  11033.000000    2.780000
75%    46109.000000  11739.000000    1.000000  11526.000000    4.750000
max    49624.000000  14971.000000    1.000000  11991.000000   12.620000

In [153]:
loan.index

RangeIndex(start=0, stop=443, step=1)

In [154]:
loan.dtypes

client_id        int64
loan_type       object
loan_amount      int64
repaid           int64
loan_id          int64
loan_start      object
loan_end        object
rate           float64
dtype: object

In [155]:
loan.shape

(443, 8)

In [156]:
loan.isnull().sum()

client_id      0
loan_type      0
loan_amount    0
repaid         0
loan_id        0
loan_start     0
loan_end       0
rate           0
dtype: int64

In [157]:
import random
for i in range(0,50):
    x=random.randrange(1,400)
    loan.loc[x,'repaid']=None

In [158]:
loan.isnull().sum()

client_id       0
loan_type       0
loan_amount     0
repaid         46
loan_id         0
loan_start      0
loan_end        0
rate            0
dtype: int64

In [159]:
loan.isnull
loan.head()

,client_id,loan_type,loan_amount,repaid,loan_id,loan_start,loan_end,rate
0,46109,home,13672,0.0,10243,2002-04-16,2003-12-20,2.15
1,46109,credit,9794,0.0,10984,2003-10-21,2005-07-17,1.25
2,46109,home,12734,1.0,10990,2006-02-01,2007-07-05,0.68
3,46109,cash,12518,NaN,10596,2010-12-08,2013-05-05,1.24
4,46109,credit,14049,1.0,11415,2010-07-07,2012-05-21,3.13

In [160]:
loan.dropna(how='any',axis=0,inplace=True)

In [161]:
loan.head()

,client_id,loan_type,loan_amount,repaid,loan_id,loan_start,loan_end,rate
0,46109,home,13672,0.0,10243,2002-04-16,2003-12-20,2.15
1,46109,credit,9794,0.0,10984,2003-10-21,2005-07-17,1.25
2,46109,home,12734,1.0,10990,2006-02-01,2007-07-05,0.68
4,46109,credit,14049,1.0,11415,2010-07-07,2012-05-21,3.13
5,46109,home,6935,0.0,11501,2006-09-17,2008-11-26,1.94

In [162]:
loan.isnull().sum()

client_id      0
loan_type      0
loan_amount    0
repaid         0
loan_id        0
loan_start     0
loan_end       0
rate           0
dtype: int64

In [163]:
loan.shape

(397, 8)

In [164]:
for i in range(0,50):
    x=random.randrange(1,400)
    loan.loc[x,'rate']=None

In [165]:
loan.isnull().sum()

client_id       6
loan_type       6
loan_amount     6
repaid          6
loan_id         6
loan_start      6
loan_end        6
rate           49
dtype: int64

In [166]:
import numpy as np


loan['rate'] = loan['rate'].replace(np.nan, 3)

In [167]:
loan.isnull().sum()

client_id      6
loan_type      6
loan_amount    6
repaid         6
loan_id        6
loan_start     6
loan_end       6
rate           0
dtype: int64